РазрешенияНаБСП24/src/DataProcessors/УдалитьСохранитьНакладныеВПапку/УдалитьСохранитьНакладныеВПапку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалитьСохранитьНакладныеВПапку</name>
  <attributes>
    <name>ДатаВывоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

РазрешенияНаБСП24/src/Documents/Накладные/Накладные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладные</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>ДатаВывоза</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПикапа</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>PermitNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/DataProcessors/УдалитьСохранитьНакладныеВПапку/Forms/Форма/Module.bsl
&НаСервере
Процедура СохранитьФайлНаСервере()
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ДатаВывоза",Объект.ДатаВывоза);
Запрос.Текст = "ВЫБРАТЬ
|	НакладныеОбразцы.Разрешение,
|	СУММА(НакладныеОбразцы.Списание) КАК Списание,
|	НакладныеОбразцы.Ссылка.Номер,
|	НакладныеОбразцы.Разрешение.Номер,
|	НакладныеОбразцы.Ссылка.ДатаВывоза
|ИЗ
|	Документ.Накладные.Образцы КАК НакладныеОбразцы
|ГДЕ
|	НакладныеОбразцы.Ссылка.Проведен
|	И НакладныеОбразцы.Ссылка.ДатаВывоза = &ДатаВывоза
|
|СГРУППИРОВАТЬ ПО
|	НакладныеОбразцы.Разрешение,
|	НакладныеОбразцы.Ссылка.Номер,
|	НакладныеОбразцы.Разрешение.Номер,
|	НакладныеОбразцы.Ссылка.ДатаВывоза";

РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();

Попытка
	Эксель = Новый COMОбъект ("Excel.Application"); 
Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат;
КонецПопытки; 
Книга = Эксель.WorkBooks.Add();
Лист = Книга.WorkSheets(1);
Лист.Name = "Общий";
НомерСтроки=1;
Лист.Cells(НомерСтроки, 1).Value = "№ Накладной";
Лист.Cells(НомерСтроки, 2).Value = "№ Разрешения";
Лист.Cells(НомерСтроки, 3).Value = "Разрешения";
Лист.Cells(НомерСтроки, 4).Value = "Итого пробирок, шт";

Пока Выборка.Следующий() Цикл
НомерСтроки = НомерСтроки+1;
Лист.Cells(НомерСтроки, 1).Value = Выборка.Номер;
Лист.Cells(НомерСтроки, 2).Value = Выборка.РазрешениеНомер;
Лист.Cells(НомерСтроки, 3).Value = "РАЗРЕШЕНИЕ МЗ РФ № " +Выборка.РазрешениеНомер+" ОТ "+Формат(Выборка.Разрешение.issued, "ДФ=dd.MM.yy");
Лист.Cells(НомерСтроки, 4).Value = Выборка.Списание;
	
	
	
КонецЦикла;

ПутьКФайлу = "\\rumows12\Файлы Разрешений\Выгрузка От "+Формат(ТекущаяДата(),"ДФ=dd.MM.yy")+" "+ Формат(ТекущаяДата(),"ДФ=чч.мм")+".xlsx";
Попытка
	Книга.SaveAs(ПутьКФайлу); 
Исключение
	Сообщить(ОписаниеОшибки()+" Файл не сохранен!"); 
КонецПопытки;

Эксель.Application.Quit();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	СохранитьФайлНаСервере();
КонецПроцедуры
